Tekla.Structures.Analysis.AnalysisModel.KeepAxisEnum
The keep axis settings.

Tekla.Structures.Analysis.AnalysisModel.KeepAxisEnum.KEEP_AXIS_NO
The keep axis setting is "no".

Tekla.Structures.Analysis.AnalysisModel.KeepAxisEnum.KEEP_AXIS_LIMITED
The keep axis setting is "limited".

Tekla.Structures.Analysis.AnalysisModel.KeepAxisEnum.KEEP_AXIS_YES
The keep axis setting is "yes".

Tekla.Structures.Analysis.AnalysisModel.KeepAxisEnum.KEEP_AXIS_FULL
The keep axis setting is "full".